Revit 2024 API
BuiltInFailures.AutoRouteFailures.MismatchedSystemTypeWarning Property
 The selected fixture is part of a different system. You may want to edit the system type and merge two systems.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MismatchedSystemTypeWarning { get; }
Visual Basic
Public Shared ReadOnly Property MismatchedSystemTypeWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MismatchedSystemTypeWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace